# Black Friday Sales Prediction

In [1]:
#Import all the nessesary library and datasets
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
test=pd.read_csv(r'C:\Users\Shubhamay\Downloads\test_HujdGe7\test.csv')
train=pd.read_csv(r'C:\Users\Shubhamay\Downloads\train_oSwQCTC\train.csv')
train.head(10)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
5,1000003,P00193542,M,26-35,15,A,3,0,1,2.0,NaN,15227
6,1000004,P00184942,M,46-50,7,B,2,1,1,8.0,17.0,19215
7,1000004,P00346142,M,46-50,7,B,2,1,1,15.0,NaN,15854
8,1000004,P0097242,M,46-50,7,B,2,1,1,16.0,NaN,15686
9,1000005,P00274942,M,26-35,20,A,1,1,8,NaN,NaN,7871

In [2]:
#Descrin train dataset
train.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,5.500680e+05,550068.000000,550068.000000,550068.000000,376430.000000,166821.000000,550068.000000
mean,1.003029e+06,8.076707,0.409653,5.404270,9.842329,12.668243,9263.968713
std,1.727592e+03,6.522660,0.491770,3.936211,5.086590,4.125338,5023.065394
min,1.000001e+06,0.000000,0.000000,1.000000,2.000000,3.000000,12.000000
25%,1.001516e+06,2.000000,0.000000,1.000000,5.000000,9.000000,5823.000000
50%,1.003077e+06,7.000000,0.000000,5.000000,9.000000,14.000000,8047.000000
75%,1.004478e+06,14.000000,1.000000,8.000000,15.000000,16.000000,12054.000000
max,1.006040e+06,20.000000,1.000000,20.000000,18.000000,18.000000,23961.000000

In [4]:
#to see how many unique vale in Occupation column
train['Occupation'].unique()

array([10, 16, 15,  7, 20,  9,  1, 12, 17,  0,  3,  4, 11,  8, 19,  2, 18,
        5, 14, 13,  6], dtype=int64)

In [5]:
#to see product_category_column
train['Product_Category_1'].value_counts()

5     150933
1     140378
8     113925
11     24287
2      23864
6      20466
3      20213
4      11753
16      9828
15      6290
13      5549
10      5125
12      3947
7       3721
18      3125
20      2550
19      1603
14      1523
17       578
9        410
Name: Product_Category_1, dtype: int64

In [6]:
#to see product_category_2 column
train['Product_Category_2'].value_counts()

8.0     64088
14.0    55108
2.0     49217
16.0    43255
15.0    37855
5.0     26235
4.0     25677
6.0     16466
11.0    14134
17.0    13320
13.0    10531
9.0      5693
12.0     5528
10.0     3043
3.0      2884
18.0     2770
7.0       626
Name: Product_Category_2, dtype: int64

In [7]:
#to see product_category_3 column
train['Product_Category_3'].value_counts()

16.0    32636
15.0    28013
14.0    18428
17.0    16702
5.0     16658
8.0     12562
9.0     11579
12.0     9246
13.0     5459
6.0      4890
18.0     4629
4.0      1875
11.0     1805
10.0     1726
3.0       613
Name: Product_Category_3, dtype: int64

In [8]:
#to see maretal status
train['Marital_Status'].unique()

array([0, 1], dtype=int64)

In [9]:
#to see how many diffent value are in stay in current city column
train['Stay_In_Current_City_Years'].unique()

array(['2', '4+', '3', '1', '0'], dtype=object)

In [10]:
#to see how many unique value are in Age column
train['Age'].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [11]:
#to see how many null value are in train dataset
train.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
dtype: int64

In [12]:
#fill null value in product_categary_2 column with mode of the column
train['Product_Category_2'].fillna(train['Product_Category_2'].mode()[0],inplace=True)

In [13]:
#fill null value product_category_3 column with mode of the column
train['Product_Category_3'].fillna(train['Product_Category_3'].mode()[0],inplace=True)

In [14]:
#to see the null vale after treetment with null value
train.isnull().sum()

User_ID                       0
Product_ID                    0
Gender                        0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category_1            0
Product_Category_2            0
Product_Category_3            0
Purchase                      0
dtype: int64

In [15]:
#to see the datatype of the train dataset
train.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [22]:
#label encode of Age column
train['Age'].replace({'0-17':0,'18-25':1,'26-35':2,'36-45':3,'46-50':4,'51-55':5,'55+':6},inplace=True)

In [23]:
#to see the age column after the label encode
train['Age'].value_counts()

2    219587
3    110013
1     99660
4     45701
5     38501
6     21504
0     15102
Name: Age, dtype: int64

In [24]:
#to see the train dataset after label encode
train.head(2)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0,10,A,2,0,3,8.0,16.0,8370
1,1000001,P00248942,F,0,10,A,2,0,1,6.0,14.0,15200

In [27]:
#label encode in stay_in_current_city_year column
train['Stay_In_Current_City_Years'].replace({'1':1,'2':2,'3':3,'4+':5,'0':0},inplace=True)

In [28]:
#to see the stay_in_current_city _year column after labelencode
train['Stay_In_Current_City_Years'].value_counts()

1    193821
2    101838
3     95285
5     84726
0     74398
Name: Stay_In_Current_City_Years, dtype: int64

In [30]:
#to see the all the column in train dataset
train.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [34]:
#to define the cat list
cat=['City_Category','Product_Category_1',
       'Product_Category_2', 'Product_Category_3']

In [36]:
#label encode of all the column present in cat list
from sklearn import preprocessing
from sklearn.preprocessing import LabelEncoder
for var in cat:
    le=preprocessing.LabelEncoder()
    train[var]=le.fit_transform(train[var])

In [37]:
#to check the datatype of the train after label encoding
train.dtypes

User_ID                        int64
Product_ID                    object
Gender                        object
Age                            int64
Occupation                     int64
City_Category                  int32
Stay_In_Current_City_Years     int64
Marital_Status                 int64
Product_Category_1             int64
Product_Category_2             int64
Product_Category_3             int64
Purchase                       int64
dtype: object

In [38]:
#to see the train dataset
train.head(10)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0,10,0,2,0,2,6,12,8370
1,1000001,P00248942,F,0,10,0,2,0,0,4,10,15200
2,1000001,P00087842,F,0,10,0,2,0,11,6,12,1422
3,1000001,P00085442,F,0,10,0,2,0,11,12,12,1057
4,1000002,P00285442,M,6,16,2,5,0,7,6,12,7969
5,1000003,P00193542,M,2,15,0,3,0,0,0,12,15227
6,1000004,P00184942,M,4,7,1,2,1,0,6,13,19215
7,1000004,P00346142,M,4,7,1,2,1,0,13,12,15854
8,1000004,P0097242,M,4,7,1,2,1,0,14,12,15686
9,1000005,P00274942,M,2,20,0,1,1,7,6,12,7871

In [40]:
#convert dummies of the gender column
dummies=pd.get_dummies(train[['Gender']])

In [41]:
#concat dummies dataframe with the  train dataframe
train=pd.concat([train,dummies],axis=1)

In [43]:
#drop gender column from the train dataset
train.drop(['Gender'],axis=1,inplace=True)

In [44]:
#to see the train dataset after get dummies and droping
train

,User_ID,Product_ID,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,Gender_F,Gender_M
0,1000001,P00069042,0,10,0,2,0,2,6,12,8370,1,0
1,1000001,P00248942,0,10,0,2,0,0,4,10,15200,1,0
2,1000001,P00087842,0,10,0,2,0,11,6,12,1422,1,0
3,1000001,P00085442,0,10,0,2,0,11,12,12,1057,1,0
4,1000002,P00285442,6,16,2,5,0,7,6,12,7969,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,5,13,1,1,1,19,6,12,368,0,1
550064,1006035,P00375436,2,1,2,3,0,19,6,12,371,1,0
550065,1006036,P00375436,2,15,1,5,1,19,6,12,137,1,0
550066,1006038,P00375436,6,1,2,2,0,19,6,12,365,1,0
550067,1006039,P00371644,4,0,1,5,1,19,6,12,490,1,0

In [45]:
#to see the datatype of the train dataset after dataclean
train.dtypes

User_ID                        int64
Product_ID                    object
Age                            int64
Occupation                     int64
City_Category                  int32
Stay_In_Current_City_Years     int64
Marital_Status                 int64
Product_Category_1             int64
Product_Category_2             int64
Product_Category_3             int64
Purchase                       int64
Gender_F                       uint8
Gender_M                       uint8
dtype: object

In [47]:
#to see null values in train dataset after data cleaning
train.isnull().sum()

User_ID                       0
Product_ID                    0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category_1            0
Product_Category_2            0
Product_Category_3            0
Purchase                      0
Gender_F                      0
Gender_M                      0
dtype: int64

In [46]:
#to  see null value in the test dataset
test.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2             72344
Product_Category_3            162562
dtype: int64

In [48]:
#preprocessing of the test dataset
#fill null value in product_categary_2 column with mode of the column
test['Product_Category_2'].fillna(test['Product_Category_2'].mode()[0],inplace=True)
#fill null value product_category_3 column with mode of the column
test['Product_Category_3'].fillna(test['Product_Category_3'].mode()[0],inplace=True)
#label encode of Age column
test['Age'].replace({'0-17':0,'18-25':1,'26-35':2,'36-45':3,'46-50':4,'51-55':5,'55+':6},inplace=True)
#label encode in stay_in_current_city_year column
test['Stay_In_Current_City_Years'].replace({'1':1,'2':2,'3':3,'4+':5,'0':0},inplace=True)
#to define the cat list
cat=['City_Category','Product_Category_1',
       'Product_Category_2', 'Product_Category_3']
#label encode of all the column present in cat list
from sklearn import preprocessing
from sklearn.preprocessing import LabelEncoder
for var in cat:
    le=preprocessing.LabelEncoder()
    test[var]=le.fit_transform(test[var])
#convert dummies of the gender column
dummies=pd.get_dummies(test[['Gender']])
#concat dummies dataframe with the  train dataframe
test=pd.concat([test,dummies],axis=1)
#drop gender column from the train dataset
test.drop(['Gender'],axis=1,inplace=True)

In [49]:
#to check the test dataset
test.head(10)

,User_ID,Product_ID,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Gender_F,Gender_M
0,1000004,P00128942,4,7,1,2,1,0,9,12,0,1
1,1000009,P00113442,2,17,2,0,0,2,3,12,0,1
2,1000010,P00288442,3,1,1,5,1,4,12,12,1,0
3,1000010,P00145342,3,1,1,5,1,3,7,12,1,0
4,1000011,P00053842,2,1,2,1,0,3,3,8,1,0
5,1000013,P00350442,4,1,2,3,1,1,1,11,0,1
6,1000013,P00155442,4,1,2,3,1,0,9,11,0,1
7,1000013,P0094542,4,1,2,3,1,1,2,5,0,1
8,1000015,P00161842,2,7,0,1,0,9,11,12,0,1
9,1000022,P00067942,1,15,0,5,0,4,12,12,0,1

In [50]:
#to check if there is any null value or not in the test dataset
test.isnull().sum()

User_ID                       0
Product_ID                    0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category_1            0
Product_Category_2            0
Product_Category_3            0
Gender_F                      0
Gender_M                      0
dtype: int64

In [58]:
#To see the columns of the train dattase
train.columns

Index(['User_ID', 'Product_ID', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase', 'Gender_F',
       'Gender_M'],
      dtype='object')

In [51]:
#to see the column of the test dataset
test.columns

Index(['User_ID', 'Product_ID', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Gender_F', 'Gender_M'],
      dtype='object')

In [57]:
#to defne the test column
col=['Age', 'Occupation', 'City_Category',\
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',\
       'Product_Category_2', 'Product_Category_3', 'Gender_F', 'Gender_M']

In [61]:
# To define the X_train,y_train,X_test
X_train=train[list(col)].values
y_train=train['Purchase'].values
X_test=test[list(col)].values

In [62]:
# to  apply RandomForestRegressor
from sklearn.ensemble import RandomForestRegressor
rf=RandomForestRegressor()
rf.fit(X_train,y_train)

RandomForestRegressor(bootstrap=True, ccp_alpha=0.0, criterion='mse',
                      max_depth=None, max_features='auto', max_leaf_nodes=None,
                      max_samples=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=1,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      n_estimators=100, n_jobs=None, oob_score=False,
                      random_state=None, verbose=0, warm_start=False)

In [63]:
#to see score of our dataset
rf.score(X_train,y_train)

0.7717205313632866

In [64]:
#to do the prediction of x dataset
prediction=rf.predict(X_test)

In [65]:
#to create new column as test dataset
test['Purchase']=prediction

In [67]:
#to create new dataset
test.to_csv('Black Friday Prediction.csv',columns=['Purchase','User_ID', 'Product_ID'],index=False)